import 'package:get/get.dart';

class TermsAndPoliciesScreenController extends GetxController {
  List<String> termsAndPoliciesText = [
    'الأهلية: لاستخدام هذا التطبيق ، يجب أن يكون عمرك 18 عامًا على الأقل وأن تفي بمتطلبات الأهلية للتبرع بالدم في بلدك.',
    'المتطلبات الصحية: قبل التبرع بالدم ، من المهم التأكد من أنك تلبي المعايير الصحية المطلوبة. الأفراد الذين يعانون من حالات طبية مثل مرض السكري أو ارتفاع ضغط الدم أو أي حالة صحية أخرى يمكن أن تعرضهم للخطر ليسوا مؤهلين للتبرع بالدم.',
    'مشاركة المعلومات: بالتسجيل في هذا التطبيق ، فإنك توافق على تقديم معلومات دقيقة عن نفسك ، بما في ذلك فصيلة الدم والتاريخ الطبي. أنت توافق أيضًا على مشاركة معلوماتك مع مراكز التبرع بالدم والمستشفيات التي تستخدم هذا التطبيق في حملات التبرع بالدم.',
    'سياسة الخصوصية: نحن نقدر خصوصيتك ولن نشارك معلوماتك الشخصية مع أي مؤسسات خارجية. سيتم مشاركة معلوماتك فقط مع مراكز التبرع بالدم والمستشفيات لغرض التبرع بالدم.',
    'الأنشطة المحظورة: يُحظر تمامًا استخدام هذا التطبيق في أي أنشطة غير قانونية ، بما في ذلك المضايقة أو الاحتيال أو أي نشاط غير قانوني آخر.',
    'سلوك المستخدم: من المتوقع أن يتصرف المستخدمون بطريقة محترمة ومسؤولة أثناء استخدام هذا التطبيق. لن يتم التسامح مع أي سلوك مسيء أو تهديدي أو غير محترم تجاه المستخدمين الآخرين.',
    'المسؤولية: نحن لسنا مسؤولين عن أي إصابة أو خسارة أو ضرر قد ينجم عن استخدام هذا التطبيق. يفهم المستخدمون ويوافقون على أنهم يتحملون جميع المخاطر المرتبطة باستخدام هذا التطبيق.',
    'الإنهاء: نحتفظ بالحق في إنهاء وصولك إلى هذا التطبيق في أي وقت إذا انتهكت أيًا من الشروط والسياسات الموضحة أعلاه.',
    'باستخدام هذا التطبيق ، فإنك توافق على الشروط والسياسات المذكورة أعلاه.',
  ];
}
